app/app/Controllers/Home.php

    public function index()
    {
        // Ambil warna dari database
        $colors = $this->getColors();

        $data = [
            'title' => 'Maulia - Professional Wedding Make Up Artist & Kostum Sewa - Grobogan',
            'paket_makeup' => $this->paketModel->where('is_active', 1)->findAll(),
            'kostum' => $this->kostumModel->where('is_active', 1)->findAll(),
---
SELECT *
FROM `paket_makeup`
WHERE `is_active` = 1
SELECT *
FROM `kostum`
WHERE `is_active` = 1

    public function paketMakeup()
    {
        // Get settings
        $pengaturan = $this->pengaturanModel->getContactInfo();

        $data = [
            'title' => 'Paket Makeup Pernikahan - ' . ($pengaturan['nama_toko'] ?? 'Maulia Wedding'),
            'paket_makeup' => $this->paketModel->where('is_active', 1)
                ->orderBy('urutan', 'ASC')
                ->orderBy('harga', 'ASC')
                ->findAll(),
---
SELECT *
FROM `paket_makeup`
WHERE `is_active` = 1
ORDER BY `urutan` ASC, `harga` ASC