app/app/Controllers/Home.php

SELECT *
FROM `paket_makeup`
WHERE `is_active` = 1
SELECT *
FROM `kostum`
WHERE `is_active` = 1
---
    public function index()
    {
        $paketModel = new \App\Models\PaketModel();
        $kostumModel = new \App\Models\KostumModel();

        $data = [
            'title' => 'Maulia - Professional Wedding Make Up Artist & Kostum Sewa - Grobogan',
            'paket_makeup' => $paketModel->where('is_active', 1)->findAll(),
            'kostum' => $kostumModel->where('is_active', 1)->findAll(),

SELECT *
FROM `paket_makeup`
WHERE `is_active` = 1
ORDER BY `urutan` ASC, `harga` ASC
---
    public function paketMakeup()
    {
        $paketModel = new \App\Models\PaketModel();
        $pengaturanModel = new \App\Models\PengaturanModel();

        // Get settings
        $pengaturan = $pengaturanModel->getContactInfo();

        $data = [
            'title' => 'Paket Makeup Pernikahan - ' . ($pengaturan['nama_toko'] ?? 'Maulia Wedding'),
            'paket_makeup' => $paketModel->where('is_active', 1)
                ->orderBy('urutan', 'ASC')
                ->orderBy('harga', 'ASC')
                ->findAll(),