app/app/Controllers/Admin/KostumAjax.php

    public function getKostum()
    {
        // Get parameters
        $draw = $this->request->getPost('draw');
        $start = $this->request->getPost('start');
        $length = $this->request->getPost('length');
        $searchValue = $this->request->getPost('search')['value'] ?? '';
        $kategori = $this->request->getPost('kategori');
        $status = $this->request->getPost('status');

        // Build query
        $builder = $this->kostumModel->builder();

        // Total records
        $totalRecords = $builder->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `kostum`

public function update($id)
{
    if (!$this->request->isAJAX()) {
        return $this->response->setJSON([
            'success' => false,
            'message' => 'Invalid request'
        ]);
    }

    $existing = $this->kostumModel->find($id);
---
SELECT *
FROM `kostum`
WHERE `kostum`.`id` = '2'

        log_message('debug', 'Data to update: ' . print_r($data, true));

        // Update database
        if ($this->kostumModel->update($id, $data)) {
---
UPDATE `kostum` SET `kategori` = 'pengantin_pria', `nama_kostum` = 'Setelan Pengantin', `deskripsi` = 'Setelan jas dan baju tradisional untuk pengantin pria', `harga_sewa` = 2500000, `durasi_sewa` = '3 hari', `spesifikasi` = '[\"Jas formal hitam\\/navy\",\"Batik pengantin pria\",\"Beskap tradisional\",\"Aksesoris lengkap\"]', `gambar` = '1765481306_60567e64942ba95969cb.png', `ukuran` = 'L', `warna` = 'MERAH', `bahan` = 'LI', `kondisi` = 'baik', `stok` = 4, `stok_tersedia` = 4, `is_active` = 1, `is_featured` = 1, `urutan` = 1, `updated_at` = '2025-12-11 19:33:29'
WHERE `kostum`.`id` IN ('2')