app/app/Controllers/Admin/Kostum.php

    public function update($id)
    {
        // Check if kostum exists
        $existing = $this->kostumModel->find($id);
---
SELECT *
FROM `kostum`
WHERE `kostum`.`id` = '1'