app/app/Controllers/Admin/PengaturanAjax.php

public function getSettings()
{
    $draw = $this->request->getGet('draw');
    $start = (int)$this->request->getGet('start');
    $length = (int)$this->request->getGet('length');
    $search = $this->request->getGet('search')['value'] ?? '';
    $category = $this->request->getGet('category') ?? 'general';
    $orderColumn = $this->request->getGet('order')[0]['column'] ?? 0;
    $orderDir = $this->request->getGet('order')[0]['dir'] ?? 'asc';

    $model = new PengaturanModel();

    // Total records tanpa filter
    $totalRecords = $model->countAll();

    // Filter by category
    if ($category && $category !== 'all') {
        $model->where('category', $category);
    }

    // Apply search
    if (!empty($search)) {
        $model->groupStart()
              ->like('key_name', $search)
              ->orLike('label', $search)
              ->orLike('value', $search)
              ->groupEnd();
    }

    // Filtered count dengan filter
    $filteredCount = $model->countAllResults(false);
---
SELECT COUNT(*) AS `numrows` FROM `pengaturan`
SELECT COUNT(*) AS `numrows`
FROM `pengaturan`
WHERE `category` = 'general'

    public function getSettingDetail($id)
    {
        $setting = $this->pengaturanModel->find($id);
---
SELECT *
FROM `pengaturan`
WHERE `pengaturan`.`id` = '20'