app/app/Controllers/Admin/PengaturanAjax.php

public function getSettings()
{
    $category = $this->request->getGet('category') ?? 'general';
    $draw = $this->request->getGet('draw');
    $start = $this->request->getGet('start') ?? 0;
    $length = $this->request->getGet('length') ?? 10;
    $searchValue = $this->request->getGet('search')['value'] ?? '';

    // Convert to integers
    $start = (int)$start;
    $length = (int)$length;

    // Query data
    $builder = $this->pengaturanModel->where('category', $category);

    // Total records
    $totalRecords = $this->pengaturanModel->where('category', $category)->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `pengaturan`
WHERE `category` = 'general'
AND `category` = 'general'