app/app/Controllers/Admin/Pesanan.php

        log_message('debug', 'Data retrieved: ' . count($pesanan) . ' records');

        // Count total records
        $totalRecords = $this->pesananModel->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `pesanan`