app/app/Models/GalleryModel.php

SELECT *
FROM `gallery`
WHERE `gallery`.`id` = '9'
---
    public function getWithRelated($id)
    {
        $gallery = $this->find($id);

SELECT *
FROM `gallery`
WHERE `is_featured` = 1
AND `is_active` = 1
ORDER BY `urutan` ASC
 LIMIT 8
---
    public function getFeatured($limit = 8)
    {
        $gallery = $this->where('is_featured', 1)
                        ->where('is_active', 1)
                        ->orderBy('urutan', 'ASC')
                        ->limit($limit)
                        ->findAll();

SELECT *
FROM `gallery`
WHERE `gallery`.`id` = '9'
SELECT *
FROM `gallery`
WHERE `kategori` = 'behind_scenes'
AND `id` != '9'
AND `is_active` = 1
ORDER BY RAND()
 LIMIT 6
---
    public function getRelated($galleryId, $limit = 6)
    {
        $currentGallery = $this->find($galleryId);

        if (!$currentGallery) {
            return [];
        }

        $related = $this->where('kategori', $currentGallery['kategori'])
                        ->where('id !=', $galleryId)
                        ->where('is_active', 1)
                        ->orderBy('RAND()')
                        ->limit($limit)
                        ->findAll();

SELECT COUNT(*) AS `numrows`
FROM `gallery`
WHERE `is_active` = 1
SELECT COUNT(*) AS `numrows`
FROM `gallery`
WHERE `is_featured` = 1
SELECT `kategori`, COUNT(*) as total
FROM `gallery`
WHERE `is_active` = 1
GROUP BY `kategori`
ORDER BY `total` DESC
SELECT `style`, COUNT(*) as total
FROM `gallery`
WHERE `is_active` = 1
AND `style` != ''
GROUP BY `style`
ORDER BY `total` DESC
---
    public function getStatistics()
    {
        $stats = [
            'total' => $this->countAll(),
            'active' => $this->where('is_active', 1)->countAllResults(),
            'featured' => $this->where('is_featured', 1)->countAllResults(),
            'by_kategori' => [],
            'by_style' => []
        ];

        // Hitung per kategori
        $builder = $this->db->table($this->table);
        $builder->select('kategori, COUNT(*) as total');
        $builder->where('is_active', 1);
        $builder->groupBy('kategori');
        $builder->orderBy('total', 'DESC');
        $result = $builder->get()->getResultArray();

        foreach ($result as $row) {
            $stats['by_kategori'][$row['kategori']] = $row['total'];
        }

        // Hitung per style
        $builder = $this->db->table($this->table);
        $builder->select('style, COUNT(*) as total');
        $builder->where('is_active', 1);
        $builder->where('style !=', '');
        $builder->groupBy('style');
        $builder->orderBy('total', 'DESC');
        $result = $builder->get()->getResultArray();