app/app/Models/KostumModel.php

    public function getByKategori($kategori, $limit = null, $featuredOnly = false)
    {
        $builder = $this->where('kategori', $kategori)
                        ->where('is_active', 1);

        if ($featuredOnly) {
            $builder->where('is_featured', 1);
        }

        $builder->orderBy('urutan', 'ASC');
        $builder->orderBy('nama_kostum', 'ASC');

        if ($limit) {
            $builder->limit($limit);
        }

        $kostum = $builder->findAll();
---
SELECT *
FROM `kostum`
WHERE `kategori` = 'lainnya'
AND `is_active` = 1
ORDER BY `urutan` ASC, `nama_kostum` ASC

    public function getAvailable($kategori = null, $limit = null)
    {
        $builder = $this->where('stok_tersedia >', 0)
                        ->where('is_active', 1);

        if ($kategori) {
            $builder->where('kategori', $kategori);
        }

        $builder->orderBy('urutan', 'ASC');

        if ($limit) {
            $builder->limit($limit);
        }

        $kostum = $builder->findAll();
---
SELECT *
FROM `kostum`
WHERE `stok_tersedia` > 0
AND `is_active` = 1
ORDER BY `urutan` ASC