app/app/Models/KostumModel.php

    public function getKostumById($id)
    {
        $kostum = $this->find($id);
---
SELECT *
FROM `kostum`
WHERE `kostum`.`id` = '1'

        // Get results
        $query = $builder->get($limit, $offset);

        return $query->getResultArray();
---
SELECT *
FROM `kostum`
ORDER BY `created_at` DESC
 LIMIT 10

    public function countFiltered($search = null, $kategori = null, $status = null)
    {
        $builder = $this->builder();

        // Search
        if (!empty($search)) {
            $builder->groupStart()
                    ->like('nama_kostum', $search)
                    ->orLike('deskripsi', $search)
                    ->orLike('ukuran', $search)
                    ->orLike('warna', $search)
                    ->orLike('bahan', $search)
                    ->groupEnd();
        }

        // Kategori filter
        if (!empty($kategori)) {
            $builder->where('kategori', $kategori);
        }

        // Status filter
        if ($status === 'active') {
            $builder->where('is_active', 1);
        } elseif ($status === 'inactive') {
            $builder->where('is_active', 0);
        }

        return $builder->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `kostum`

    public function getStatistics()
    {
        $stats = [
            'total' => $this->countAll(),
            'active' => $this->where('is_active', 1)->countAllResults(),
            'inactive' => $this->where('is_active', 0)->countAllResults(),
            'featured' => $this->where('is_featured', 1)->countAllResults(),
            'out_of_stock' => $this->where('stok_tersedia', 0)->where('is_active', 1)->countAllResults(),
            'low_stock' => $this->where('stok_tersedia >', 0)
                               ->where('stok_tersedia <=', 2)
                               ->where('is_active', 1)
                               ->countAllResults(),
            'by_kategori' => []
        ];

        // Hitung per kategori
        $builder = $this->builder();
        $builder->select('kategori, COUNT(*) as total');
        $builder->where('is_active', 1);
        $builder->groupBy('kategori');
        $builder->orderBy('total', 'DESC');
        $result = $builder->get()->getResultArray();
---
SELECT COUNT(*) AS `numrows`
FROM `kostum`
WHERE `is_active` = 1
SELECT COUNT(*) AS `numrows`
FROM `kostum`
WHERE `is_active` = 0
SELECT COUNT(*) AS `numrows`
FROM `kostum`
WHERE `is_featured` = 1
SELECT COUNT(*) AS `numrows`
FROM `kostum`
WHERE `stok_tersedia` = 0
AND `is_active` = 1
SELECT COUNT(*) AS `numrows`
FROM `kostum`
WHERE `stok_tersedia` > 0
AND `stok_tersedia` <= 2
AND `is_active` = 1
SELECT `kategori`, COUNT(*) as total
FROM `kostum`
WHERE `is_active` = 1
GROUP BY `kategori`
ORDER BY `total` DESC