app/app/Models/MitraModel.php

SELECT DISTINCT `spesialisasi`
FROM `mitra`
WHERE `spesialisasi` != ''
AND `is_active` = 1
ORDER BY `spesialisasi` ASC
---
    public function getSpesialisasiOptions()
    {
        $builder = $this->db->table($this->table);
        $builder->select('spesialisasi');
        $builder->distinct();
        $builder->where('spesialisasi !=', '');
        $builder->where('is_active', 1);
        $builder->orderBy('spesialisasi', 'ASC');
        $query = $builder->get();

SELECT COUNT(*) AS `numrows`
FROM `mitra`
WHERE `is_active` = 1
SELECT COUNT(*) AS `numrows`
FROM `mitra`
WHERE `is_featured` = 1
SELECT `kategori`, COUNT(*) as total
FROM `mitra`
WHERE `is_active` = 1
GROUP BY `kategori`
ORDER BY `total` DESC
SELECT `spesialisasi`, COUNT(*) as total
FROM `mitra`
WHERE `is_active` = 1
GROUP BY `spesialisasi`
ORDER BY `total` DESC
---
    public function getStatistics()
    {
        $stats = [
            'total' => $this->countAll(),
            'active' => $this->where('is_active', 1)->countAllResults(),
            'featured' => $this->where('is_featured', 1)->countAllResults(),
            'by_kategori' => [],
            'by_spesialisasi' => []
        ];

        // Hitung per kategori
        $builder = $this->db->table($this->table);
        $builder->select('kategori, COUNT(*) as total');
        $builder->where('is_active', 1);
        $builder->groupBy('kategori');
        $builder->orderBy('total', 'DESC');
        $result = $builder->get()->getResultArray();

        foreach ($result as $row) {
            $stats['by_kategori'][$row['kategori']] = $row['total'];
        }

        // Hitung per spesialisasi
        $builder = $this->db->table($this->table);
        $builder->select('spesialisasi, COUNT(*) as total');
        $builder->where('is_active', 1);
        $builder->groupBy('spesialisasi');
        $builder->orderBy('total', 'DESC');
        $result = $builder->get()->getResultArray();