app/app/Models/PengaturanModel.php

SELECT *
FROM `pengaturan`
WHERE `key_name` = 'nama_toko'
AND `is_active` = 1
 LIMIT 1
---
    public function getByKey($key, $default = null)
    {
        $setting = $this->where('key_name', $key)
                        ->where('is_active', 1)
                        ->first();

SELECT *
FROM `pengaturan`
WHERE `key_name` IN ('nama_toko','alamat','whatsapp','telepon','email','jam_kerja','latitude','longitude','google_maps_url')
AND `is_active` = 1
---
    public function getByKeys(array $keys)
    {
        $settings = $this->whereIn('key_name', $keys)
                         ->where('is_active', 1)
                         ->findAll();

SELECT `category`
FROM `pengaturan`
GROUP BY `category`
ORDER BY `category`
---
    public function getCategories()
    {
        $categories = $this->select('category')
                          ->groupBy('category')
                          ->orderBy('category')
                          ->findAll();