app/app/Models/PesananModel.php

        $builder->where('p.jenis_layanan', $layanan);
    }

    return $builder->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `pesanan` `p`

    private function countByStatus($status, $search = null, $date = null, $layanan = null, $dateRange = null)
    {
        $builder = $this->db->table('pesanan');
        $builder->where('status', $status);

        if ($search) {
            $builder->groupStart();
            $builder->like('kode_pesanan', $search);
            $builder->orLike('nama_lengkap', $search);
            $builder->orLike('no_whatsapp', $search);
            $builder->groupEnd();
        }

        if ($date && $date !== '') {
            $builder->where('DATE(tanggal_acara)', $date);
        }

        if ($layanan && $layanan !== '') {
            $builder->where('jenis_layanan', $layanan);
        }

        if ($dateRange && $dateRange !== '') {
            list($startDate, $endDate) = explode(' to ', $dateRange);
            if ($startDate && $endDate) {
                $builder->where('DATE(tanggal_acara) >=', $startDate);
                $builder->where('DATE(tanggal_acara) <=', $endDate);
            }
        }

        return $builder->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `pesanan`
WHERE `status` = 'pending'

    public function getForReport($search = null, $status = null, $date = null, $layanan = null)
    {
        $builder = $this->db->table('pesanan p');
        $builder->select('p.*, pm.nama_paket, pm.harga as paket_harga, k.nama_kostum, k.harga_sewa as kostum_harga');
        $builder->join('paket_makeup pm', 'pm.id = p.paket_id', 'left');
        $builder->join('kostum k', 'k.id = p.kostum_id', 'left');

        if ($search) {
            $builder->groupStart();
            $builder->like('p.kode_pesanan', $search);
            $builder->orLike('p.nama_lengkap', $search);
            $builder->orLike('p.no_whatsapp', $search);
            $builder->groupEnd();
        }

        if ($status && $status !== '') {
            $builder->where('p.status', $status);
        }

        if ($date && $date !== '') {
            $builder->where('DATE(p.tanggal_acara)', $date);
        }

        if ($layanan && $layanan !== '') {
            $builder->where('p.jenis_layanan', $layanan);
        }

        $builder->orderBy('p.created_at', 'DESC');

        return $builder->get()->getResultArray();
---
SELECT `p`.*, `pm`.`nama_paket`, `pm`.`harga` as `paket_harga`, `k`.`nama_kostum`, `k`.`harga_sewa` as `kostum_harga`
FROM `pesanan` `p`
LEFT JOIN `paket_makeup` `pm` ON `pm`.`id` = `p`.`paket_id`
LEFT JOIN `kostum` `k` ON `k`.`id` = `p`.`kostum_id`
ORDER BY `p`.`created_at` DESC